/** biome-ignore-all lint/style/noNonNullAssertion: tests can tolerate it */
import { describe, expect, test } from 'vitest'
import { getVerb, type VerbForm } from '../verbs'
import { conjugatePast } from './past'

describe('active past', () => {
  test.each<[string, VerbForm, string]>([
    ['أتي', 1, 'أَتَى'],
    ['أمن', 1, 'أَمِنَ'],
    ['أمن', 4, 'آمَنَ'],
    ['أنشأ', 4, 'أَنْشَأَ'],
    ['أوي', 1, 'أَوَى'],
    ['أوي', 10, 'اِسْتَأْوَى'],
    ['أوي', 4, 'آوَى'],
    ['بدل', 10, 'اِسْتَبْدَلَ'],
    ['بدل', 2, 'بَدَّلَ'],
    ['جلس', 1, 'جَلَسَ'],
    ['حبب', 1, 'حَبَّ'],
    ['حبب', 2, 'حَبَّبَ'],
    ['حرب', 3, 'حَارَبَ'],
    ['حمر', 9, 'اِحْمَرَّ'],
    ['عدد', 4, 'أَعَدَّ'],
    ['عطى', 4, 'أَعْطَى'],
    ['علم', 5, 'تَعَلَّمَ'],
    ['عون', 10, 'اِسْتَعَانَ'],
    ['عون', 3, 'عَاوَنَ'],
    ['عون', 4, 'أَعَانَ'],
    ['عون', 6, 'تَعَاوَنَ'],
    ['غدو', 1, 'غَدَا'],
    ['فجر', 7, 'اِنْفَجَرَ'],
    ['قود', 10, 'اِسْتَقَادَ'],
    ['قود', 3, 'قَاوَدَ'],
    ['قود', 7, 'اِنْقَادَ'],
    ['قود', 8, 'اِقْتَادَ'],
    ['نهي', 8, 'اِنْتَهَى'],
    ['وصل', 8, 'اِتَّصَلَ'],
    ['وعد', 1, 'وَعَدَ'],
    ['وقي', 1, 'وَقَى'],
    ['ولى', 1, 'وَلِي'],
    ['جيء', 1, 'جَاءَ'],
    ['جيء', 4, 'أَجَاءَ'],
    ['جيء', 6, 'تَجَاءَ'],
  ])('%s (%d) pattern is %s', (root, form, expected) => {
    const verb = getVerb(root, form)
    const past = conjugatePast(verb)
    expect(past['3ms']).toBe(expected)
  })

  describe('regular verbs', () => {
    describe('ك-ت-ب', () => {
      test('كَتَبَ (Form I)', () => {
        expect(conjugatePast(getVerb('كتب', 1))).toEqual({
          '1s': 'كَتَبْتُ',
          '2ms': 'كَتَبْتَ',
          '2fs': 'كَتَبْتِ',
          '3ms': 'كَتَبَ',
          '3fs': 'كَتَبَتْ',
          '2d': 'كَتَبْتُمَا',
          '3dm': 'كَتَبَا',
          '3df': 'كَتَبَتَا',
          '1p': 'كَتَبْنَا',
          '2pm': 'كَتَبْتُمْ',
          '2pf': 'كَتَبْتُنَّ',
          '3pf': 'كَتَبْنَ',
          '3pm': 'كَتَبُوا',
        })
      })

      test('كَتَّبَ (Form II)', () => {
        expect(conjugatePast(getVerb('كتب', 2))).toEqual({
          '1s': 'كَتَّبْتُ',
          '2ms': 'كَتَّبْتَ',
          '2fs': 'كَتَّبْتِ',
          '3ms': 'كَتَّبَ',
          '3fs': 'كَتَّبَتْ',
          '2d': 'كَتَّبْتُمَا',
          '3dm': 'كَتَّبَا',
          '3df': 'كَتَّبَتَا',
          '1p': 'كَتَّبْنَا',
          '2pm': 'كَتَّبْتُمْ',
          '2pf': 'كَتَّبْتُنَّ',
          '3pf': 'كَتَّبْنَ',
          '3pm': 'كَتَّبُوا',
        })
      })

      test('كَاتَبَ (Form III)', () => {
        expect(conjugatePast(getVerb('كتب', 3))).toEqual({
          '1s': 'كَاتَبْتُ',
          '2ms': 'كَاتَبْتَ',
          '2fs': 'كَاتَبْتِ',
          '3ms': 'كَاتَبَ',
          '3fs': 'كَاتَبَتْ',
          '2d': 'كَاتَبْتُمَا',
          '3dm': 'كَاتَبَا',
          '3df': 'كَاتَبَتَا',
          '1p': 'كَاتَبْنَا',
          '2pm': 'كَاتَبْتُمْ',
          '2pf': 'كَاتَبْتُنَّ',
          '3pf': 'كَاتَبْنَ',
          '3pm': 'كَاتَبُوا',
        })
      })

      test('أَكْتَبَ (Form IV)', () => {
        expect(conjugatePast(getVerb('كتب', 4))).toEqual({
          '1s': 'أَكْتَبْتُ',
          '2ms': 'أَكْتَبْتَ',
          '2fs': 'أَكْتَبْتِ',
          '3ms': 'أَكْتَبَ',
          '3fs': 'أَكْتَبَتْ',
          '2d': 'أَكْتَبْتُمَا',
          '3dm': 'أَكْتَبَا',
          '3df': 'أَكْتَبَتَا',
          '1p': 'أَكْتَبْنَا',
          '2pm': 'أَكْتَبْتُمْ',
          '2pf': 'أَكْتَبْتُنَّ',
          '3pf': 'أَكْتَبْنَ',
          '3pm': 'أَكْتَبُوا',
        })
      })

      test('تَكَتَّبَ (Form V)', () => {
        expect(conjugatePast(getVerb('كتب', 5))).toEqual({
          '1s': 'تَكَتَّبْتُ',
          '2ms': 'تَكَتَّبْتَ',
          '2fs': 'تَكَتَّبْتِ',
          '3ms': 'تَكَتَّبَ',
          '3fs': 'تَكَتَّبَتْ',
          '2d': 'تَكَتَّبْتُمَا',
          '3dm': 'تَكَتَّبَا',
          '3df': 'تَكَتَّبَتَا',
          '1p': 'تَكَتَّبْنَا',
          '2pm': 'تَكَتَّبْتُمْ',
          '2pf': 'تَكَتَّبْتُنَّ',
          '3pf': 'تَكَتَّبْنَ',
          '3pm': 'تَكَتَّبُوا',
        })
      })

      test('تَكَاتَبَ (Form VI)', () => {
        expect(conjugatePast(getVerb('كتب', 6))).toEqual({
          '1s': 'تَكَاتَبْتُ',
          '2ms': 'تَكَاتَبْتَ',
          '2fs': 'تَكَاتَبْتِ',
          '3ms': 'تَكَاتَبَ',
          '3fs': 'تَكَاتَبَتْ',
          '2d': 'تَكَاتَبْتُمَا',
          '3dm': 'تَكَاتَبَا',
          '3df': 'تَكَاتَبَتَا',
          '1p': 'تَكَاتَبْنَا',
          '2pm': 'تَكَاتَبْتُمْ',
          '2pf': 'تَكَاتَبْتُنَّ',
          '3pf': 'تَكَاتَبْنَ',
          '3pm': 'تَكَاتَبُوا',
        })
      })

      test('اِنْكَتَبَ (Form VII)', () => {
        expect(conjugatePast(getVerb('كتب', 7))).toEqual({
          '1s': 'اِنْكَتَبْتُ',
          '2ms': 'اِنْكَتَبْتَ',
          '2fs': 'اِنْكَتَبْتِ',
          '3ms': 'اِنْكَتَبَ',
          '3fs': 'اِنْكَتَبَتْ',
          '2d': 'اِنْكَتَبْتُمَا',
          '3dm': 'اِنْكَتَبَا',
          '3df': 'اِنْكَتَبَتَا',
          '1p': 'اِنْكَتَبْنَا',
          '2pm': 'اِنْكَتَبْتُمْ',
          '2pf': 'اِنْكَتَبْتُنَّ',
          '3pf': 'اِنْكَتَبْنَ',
          '3pm': 'اِنْكَتَبُوا',
        })
      })
    })
  })

  describe('assimilated verbs', () => {
    describe('و-ع-د', () => {
      test('وَعَدَ (Form I)', () => {
        expect(conjugatePast(getVerb('وعد', 1))).toEqual({
          '1s': 'وَعَدْتُ',
          '2ms': 'وَعَدْتَ',
          '2fs': 'وَعَدْتِ',
          '3ms': 'وَعَدَ',
          '3fs': 'وَعَدَتْ',
          '2d': 'وَعَدْتُمَا',
          '3dm': 'وَعَدَا',
          '3df': 'وَعَدَتَا',
          '1p': 'وَعَدْنَا',
          '2pm': 'وَعَدْتُمْ',
          '2pf': 'وَعَدْتُنَّ',
          '3pf': 'وَعَدْنَ',
          '3pm': 'وَعَدُوا',
        })
      })

      test('تَوَعَّدَ (Form V)', () => {
        expect(conjugatePast(getVerb('وعد', 5))).toEqual({
          '1s': 'تَوَعَّدْتُ',
          '2ms': 'تَوَعَّدْتَ',
          '2fs': 'تَوَعَّدْتِ',
          '3ms': 'تَوَعَّدَ',
          '3fs': 'تَوَعَّدَتْ',
          '2d': 'تَوَعَّدْتُمَا',
          '3dm': 'تَوَعَّدَا',
          '3df': 'تَوَعَّدَتَا',
          '1p': 'تَوَعَّدْنَا',
          '2pm': 'تَوَعَّدْتُمْ',
          '2pf': 'تَوَعَّدْتُنَّ',
          '3pf': 'تَوَعَّدْنَ',
          '3pm': 'تَوَعَّدُوا',
        })
      })
    })
  })

  describe('hollow verbs', () => {
    describe('ق-و-ل', () => {
      test('قَالَ (Form I)', () => {
        expect(conjugatePast(getVerb('قول', 1))).toEqual({
          '1s': 'قُلْتُ',
          '2ms': 'قُلْتَ',
          '2fs': 'قُلْتِ',
          '3ms': 'قَالَ',
          '3fs': 'قَالَتْ',
          '2d': 'قُلْتُمَا',
          '3dm': 'قَالَا',
          '3df': 'قَالَتَا',
          '1p': 'قُلْنَا',
          '2pm': 'قُلْتُمْ',
          '2pf': 'قُلْتُنَّ',
          '3pf': 'قُلْنَ',
          '3pm': 'قَالُوا',
        })
      })

      test('قَوَّلَ (Form II)', () => {
        expect(conjugatePast(getVerb('قول', 2))).toEqual({
          '1s': 'قَوَّلْتُ',
          '2ms': 'قَوَّلْتَ',
          '2fs': 'قَوَّلْتِ',
          '3ms': 'قَوَّلَ',
          '3fs': 'قَوَّلَتْ',
          '2d': 'قَوَّلْتُمَا',
          '3dm': 'قَوَّلَا',
          '3df': 'قَوَّلَتَا',
          '1p': 'قَوَّلْنَا',
          '2pm': 'قَوَّلْتُمْ',
          '2pf': 'قَوَّلْتُنَّ',
          '3pf': 'قَوَّلْنَ',
          '3pm': 'قَوَّلُوا',
        })
      })

      test('قَاوَلَ (Form III)', () => {
        expect(conjugatePast(getVerb('قول', 3))).toEqual({
          '1s': 'قَاوَلْتُ',
          '2ms': 'قَاوَلْتَ',
          '2fs': 'قَاوَلْتِ',
          '3ms': 'قَاوَلَ',
          '3fs': 'قَاوَلَتْ',
          '2d': 'قَاوَلْتُمَا',
          '3dm': 'قَاوَلَا',
          '3df': 'قَاوَلَتَا',
          '1p': 'قَاوَلْنَا',
          '2pm': 'قَاوَلْتُمْ',
          '2pf': 'قَاوَلْتُنَّ',
          '3pf': 'قَاوَلْنَ',
          '3pm': 'قَاوَلُوا',
        })
      })

      test('أَقَالَ (Form IV)', () => {
        expect(conjugatePast(getVerb('قول', 4))).toEqual({
          '1s': 'أَقُلْتُ',
          '2ms': 'أَقُلْتَ',
          '2fs': 'أَقُلْتِ',
          '3ms': 'أَقَالَ',
          '3fs': 'أَقَالَتْ',
          '2d': 'أَقُلْتُمَا',
          '3dm': 'أَقَالَا',
          '3df': 'أَقَالَتَا',
          '1p': 'أَقُلْنَا',
          '2pm': 'أَقُلْتُمْ',
          '2pf': 'أَقُلْتُنَّ',
          '3pf': 'أَقُلْنَ',
          '3pm': 'أَقَالُوا',
        })
      })
    })
  })

  describe('defective verbs', () => {
    describe('ر-م-ي', () => {
      test('رَمَى (Form I)', () => {
        expect(conjugatePast(getVerb('رمي', 1))).toEqual({
          '1s': 'رَمَيْتُ',
          '2ms': 'رَمَيْتَ',
          '2fs': 'رَمَيْتِ',
          '3ms': 'رَمَى',
          '3fs': 'رَمَتْ',
          '2d': 'رَمَيْتُمَا',
          '3dm': 'رَمَيَا',
          '3df': 'رَمَتَا',
          '1p': 'رَمَيْنَا',
          '2pm': 'رَمَيْتُمْ',
          '2pf': 'رَمَيْتُنَّ',
          '3pf': 'رَمَيْنَ',
          '3pm': 'رَمَوْا',
        })
      })

      test('رَمَّى (Form II)', () => {
        expect(conjugatePast(getVerb('رمي', 2))).toEqual({
          '1s': 'رَمَّيْتُ',
          '2ms': 'رَمَّيْتَ',
          '2fs': 'رَمَّيْتِ',
          '3ms': 'رَمَّى',
          '3fs': 'رَمَّتْ',
          '2d': 'رَمَّيْتُمَا',
          '3dm': 'رَمَّيَا',
          '3df': 'رَمَّتَا',
          '1p': 'رَمَّيْنَا',
          '2pm': 'رَمَّيْتُمْ',
          '2pf': 'رَمَّيْتُنَّ',
          '3pf': 'رَمَّيْنَ',
          '3pm': 'رَمَّوْا',
        })
      })

      test('اِنْرَمَى (Form VII)', () => {
        expect(conjugatePast(getVerb('رمي', 7))).toEqual({
          '1s': 'اِنْرَمَيْتُ',
          '2ms': 'اِنْرَمَيْتَ',
          '2fs': 'اِنْرَمَيْتِ',
          '3ms': 'اِنْرَمَى',
          '3fs': 'اِنْرَمَتْ',
          '2d': 'اِنْرَمَيْتُمَا',
          '3dm': 'اِنْرَمَيَا',
          '3df': 'اِنْرَمَتَا',
          '1p': 'اِنْرَمَيْنَا',
          '2pm': 'اِنْرَمَيْتُمْ',
          '2pf': 'اِنْرَمَيْتُنَّ',
          '3pf': 'اِنْرَمَيْنَ',
          '3pm': 'اِنْرَمَوْا',
        })
      })
    })
  })

  describe('hamzated initial verbs', () => {
    describe('أ-خ-ذ', () => {
      test('أَخَذَ (Form I)', () => {
        expect(conjugatePast(getVerb('أخذ', 1))).toEqual({
          '1s': 'أَخَذْتُ',
          '2ms': 'أَخَذْتَ',
          '2fs': 'أَخَذْتِ',
          '3ms': 'أَخَذَ',
          '3fs': 'أَخَذَتْ',
          '2d': 'أَخَذْتُمَا',
          '3dm': 'أَخَذَا',
          '3df': 'أَخَذَتَا',
          '1p': 'أَخَذْنَا',
          '2pm': 'أَخَذْتُمْ',
          '2pf': 'أَخَذْتُنَّ',
          '3pf': 'أَخَذْنَ',
          '3pm': 'أَخَذُوا',
        })
      })

      test('اِتَّخَذَ (Form VIII)', () => {
        expect(conjugatePast(getVerb('أخذ', 8))).toEqual({
          '1s': 'اِتَّخَذْتُ',
          '2ms': 'اِتَّخَذْتَ',
          '2fs': 'اِتَّخَذْتِ',
          '3ms': 'اِتَّخَذَ',
          '3fs': 'اِتَّخَذَتْ',
          '2d': 'اِتَّخَذْتُمَا',
          '3dm': 'اِتَّخَذَا',
          '3df': 'اِتَّخَذَتَا',
          '1p': 'اِتَّخَذْنَا',
          '2pm': 'اِتَّخَذْتُمْ',
          '2pf': 'اِتَّخَذْتُنَّ',
          '3pf': 'اِتَّخَذْنَ',
          '3pm': 'اِتَّخَذُوا',
        })
      })

      test('اِسْتَأْخَذَ (Form X)', () => {
        expect(conjugatePast(getVerb('أخذ', 10))).toEqual({
          '1s': 'اِسْتَأْخَذْتُ',
          '2ms': 'اِسْتَأْخَذْتَ',
          '2fs': 'اِسْتَأْخَذْتِ',
          '3ms': 'اِسْتَأْخَذَ',
          '3fs': 'اِسْتَأْخَذَتْ',
          '2d': 'اِسْتَأْخَذْتُمَا',
          '3dm': 'اِسْتَأْخَذَا',
          '3df': 'اِسْتَأْخَذَتَا',
          '1p': 'اِسْتَأْخَذْنَا',
          '2pm': 'اِسْتَأْخَذْتُمْ',
          '2pf': 'اِسْتَأْخَذْتُنَّ',
          '3pf': 'اِسْتَأْخَذْنَ',
          '3pm': 'اِسْتَأْخَذُوا',
        })
      })
    })
  })

  describe('hamzated middle verbs', () => {
    describe.todo('س-أ-ل')
  })

  describe('hamzated final verbs', () => {
    describe.todo('ق-ر-أ')
  })

  describe('doubly weak verbs', () => {
    describe.todo('و-ق-ي')
    describe.todo('و-ف-ي')
    describe.todo('ر-و-ي')
  })

  describe('hamzated initial defective verbs', () => {
    describe.todo('أ-ت-ي')
  })

  describe('hamzated middle assimilated verbs', () => {
    describe.todo('و-ئ-د')
  })

  describe('hamzated middle defective verbs', () => {
    describe.todo('ب-د-أ')
  })

  describe('hamzated final assimilated verbs', () => {
    describe.todo('و-أ-ى')
  })

  describe('hamzated final hollow verbs', () => {
    describe.todo('ج-ي-ء')
  })

  test('defective endings for أعطى', () => {
    expect(conjugatePast(getVerb('عطى', 4))).toEqual({
      '1s': 'أَعْطَيْتُ',
      '2ms': 'أَعْطَيْتَ',
      '2fs': 'أَعْطَيْتِ',
      '3ms': 'أَعْطَى',
      '3fs': 'أَعْطَتْ',
      '2d': 'أَعْطَيْتُمَا',
      '3dm': 'أَعْطَيَا',
      '3df': 'أَعْطَتَا',
      '1p': 'أَعْطَيْنَا',
      '2pm': 'أَعْطَيْتُمْ',
      '2pf': 'أَعْطَيْتُنَّ',
      '3pf': 'أَعْطَيْنَ',
      '3pm': 'أَعْطَوْا',
    })
  })

  test('shorten with suffixes for hollow verbs like قال', () => {
    expect(conjugatePast(getVerb('قول', 1))).toEqual({
      '1s': 'قُلْتُ',
      '2ms': 'قُلْتَ',
      '2fs': 'قُلْتِ',
      '3ms': 'قَالَ',
      '3fs': 'قَالَتْ',
      '2d': 'قُلْتُمَا',
      '3dm': 'قَالَا',
      '3df': 'قَالَتَا',
      '1p': 'قُلْنَا',
      '2pm': 'قُلْتُمْ',
      '2pf': 'قُلْتُنَّ',
      '3pm': 'قَالُوا',
      '3pf': 'قُلْنَ',
    })
  })

  test('hollow verb with final hamza for جَاءَ', () => {
    expect(conjugatePast(getVerb('جيء', 1))).toEqual({
      '3ms': 'جَاءَ',
      '3fs': 'جَاءَتْ',
      '3dm': 'جَاءَا',
      '3df': 'جَاءَتَا',
      '3pm': 'جَاؤُوا',
      '3pf': 'جِئْنَ',
      '2ms': 'جِئْتَ',
      '2fs': 'جِئْتِ',
      '2d': 'جِئْتُمَا',
      '2pm': 'جِئْتُمْ',
      '2pf': 'جِئْتُنَّ',
      '1s': 'جِئْتُ',
      '1p': 'جِئْنَا',
    })
  })

  test('Form IV hollow verb with final hamza for أَجَاءَ', () => {
    expect(conjugatePast(getVerb('جيء', 4))).toEqual({
      '3ms': 'أَجَاءَ',
      '3fs': 'أَجَاءَتْ',
      '3dm': 'أَجَاءَا',
      '3df': 'أَجَاءَتَا',
      '3pm': 'أَجَاؤُوا',
      '3pf': 'أَجِئْنَ',
      '2ms': 'أَجِئْتَ',
      '2fs': 'أَجِئْتِ',
      '2d': 'أَجِئْتُمَا',
      '2pm': 'أَجِئْتُمْ',
      '2pf': 'أَجِئْتُنَّ',
      '1s': 'أَجِئْتُ',
      '1p': 'أَجِئْنَا',
    })
  })

  test('Form VI hollow verb with final hamza for تَجَاءَ', () => {
    expect(conjugatePast(getVerb('جيء', 6))).toEqual({
      '3ms': 'تَجَاءَ',
      '3fs': 'تَجَاءَتْ',
      '3dm': 'تَجَاءَا',
      '3df': 'تَجَاءَتَا',
      '3pm': 'تَجَاؤُوا',
      '3pf': 'تَجِئْنَ',
      '2ms': 'تَجِئْتَ',
      '2fs': 'تَجِئْتِ',
      '2d': 'تَجِئْتُمَا',
      '2pm': 'تَجِئْتُمْ',
      '2pf': 'تَجِئْتُنَّ',
      '1s': 'تَجِئْتُ',
      '1p': 'تَجِئْنَا',
    })
  })
})
