import { describe, expect, test } from 'vitest'
import { getVerb, type VerbForm } from '../verbs'
import { conjugatePresentMood } from './present'

describe('active present indicative pattern', () => {
  test.each<[string, VerbForm, string]>([
    ['أتي', 1, 'يَأْتِي'],
    ['أمن', 4, 'يُؤْمِنُ'],
    ['أذن', 1, 'يَأْذَنُ'],
    ['أمم', 1, 'يَؤُمُّ'],
    ['أسر', 1, 'يَأْسِرُ'],
    ['أخذ', 1, 'يَأْخُذُ'],
    ['أنشأ', 4, 'يُنْشِئُ'],
    ['أكد', 2, 'يُؤَكِّدُ'],
    ['أود', 2, 'يُؤَوِّدُ'],
    ['أثر', 2, 'يُؤَثِّرُ'],
    ['أوي', 1, 'يَأْوِي'],
    ['أوي', 4, 'يُؤْوِي'],
    ['باع', 1, 'يَبِيعُ'],
    ['زور', 1, 'يَزُورُ'],
    ['دعا', 1, 'يَدْعُو'],
    ['بكي', 1, 'يَبْكِي'],
    ['بدأ', 1, 'يَبْدَأُ'],
    ['بدل', 1, 'يَبْدِلُ'],
    ['ترجم', 1, 'يُتَرْجِمُ'],
    ['جلس', 1, 'يَجْلِسُ'],
    ['جعل', 1, 'يَجْعَلُ'],
    ['تمم', 1, 'يَتِمُّ'],
    ['قرح', 8, 'يَقْتَرِحُ'],
    ['ذكر', 1, 'يَذْكُرُ'],
    ['ذكر', 2, 'يُذَكِّرُ'],
    ['ضمن', 1, 'يَضْمَنُ'],
    ['ضمن', 2, 'يُضَمِّنُ'],
    ['ضمن', 5, 'يَتَضَمَّنُ'],
    ['عمل', 1, 'يَعْمَلُ'],
    ['عمل', 2, 'يُعَمِّلُ'],
    ['جمع', 5, 'يَتَجَمَّعُ'],
    ['جمع', 1, 'يَجْمَعُ'],
    ['جمع', 2, 'يُجَمِّعُ'],
    ['صبح', 2, 'يُصَبِّحُ'],
    ['صبح', 1, 'يَصْبَحُ'],
    ['حبب', 1, 'يَحِبُّ'],
    ['حبب', 2, 'يُحَبِّبُ'],
    ['حبب', 4, 'يُحِبُّ'],
    ['حبب', 5, 'يَتَحَبَّبُ'],
    ['حبب', 6, 'يَتَحَابُّ'],
    ['حبب', 10, 'يَسْتَحِبُّ'],
    ['ظلل', 1, 'يَظَلُّ'],
    ['حبط', 1, 'يَحْبَطُ'],
    ['مثل', 1, 'يَمْثُلُ'],
    ['حسب', 1, 'يَحْسُبُ'],
    ['حضر', 1, 'يَحْضُرُ'],
    ['حلق', 1, 'يَحْلِقُ'],
    ['حلم', 1, 'يَحْلُمُ'],
    ['حدث', 1, 'يَحْدُثُ'],
    ['حمر', 9, 'يَحْمَرُّ'],
    ['حمم', 10, 'يَسْتَحِمُّ'],
    ['هلل', 1, 'يَهُلُّ'],
    ['خسر', 1, 'يَخْسَرُ'],
    ['دحرج', 1, 'يُدَحْرِجُ'],
    ['درس', 1, 'يَدْرُسُ'],
    ['رأى', 1, 'يَرَى'],
    ['صفر', 9, 'يَصْفَرُّ'],
    ['صبح', 4, 'يُصْبِحُ'],
    ['ضيف', 10, 'يَسْتَضِيفُ'],
    ['ضيف', 4, 'يُضِيفُ'],
    ['طلب', 5, 'يَتَطَلَّبُ'],
    ['عطى', 4, 'يُعْطِي'],
    ['عون', 10, 'يَسْتَعِينُ'],
    ['عون', 3, 'يُعَاوِنُ'],
    ['عون', 4, 'يُعِينُ'],
    ['عون', 6, 'يَتَعَاوَنُ'],
    ['عنن', 1, 'يَعِنُّ'],
    ['عمل', 10, 'يَسْتَعْمِلُ'],
    ['غدو', 1, 'يَغْدُو'],
    ['لوم', 1, 'يَلُومُ'],
    ['بيت', 1, 'يَبِيتُ'],
    ['حول', 1, 'يَحُولُ'],
    ['عوم', 1, 'يَعُومُ'],
    ['قول', 1, 'يَقُولُ'],
    ['عوز', 1, 'يَعْوَزُ'],
    ['ميل', 1, 'يَمْيَلُ'],
    ['مسي', 4, 'يُمْسِي'],
    ['صير', 1, 'يَصِيرُ'],
    ['ضحي', 4, 'يُضْحِي'],
    ['حول', 5, 'يَتَحَوَّلُ'],
    ['مكن', 4, 'يُمْكِنُ'],
    ['فسر', 2, 'يُفَسِّرُ'],
    ['فلت', 4, 'يُفْلِتُ'],
    ['قتل', 1, 'يَقْتُلُ'],
    ['جبب', 1, 'يَجُبُّ'],
    ['جيد', 1, 'يَجْيَدُ'],
    ['جري', 1, 'يَجْرِي'],
    ['قرر', 1, 'يَقَرُّ'],
    ['قرر', 4, 'يُقِرُّ'],
    ['لمم', 1, 'يَلُمُّ'],
    ['أخذ', 8, 'يَتَّخِذُ'],
    ['قفز', 1, 'يَقْفِزُ'],
    ['قود', 10, 'يَسْتَقِيدُ'],
    ['قود', 8, 'يَقْتَادُ'],
    ['كسر', 1, 'يَكْسِرُ'],
    ['نبأ', 4, 'يُنْبِئُ'],
    ['هجر', 1, 'يَهْجُرُ'],
    ['وصل', 8, 'يَتَّصِلُ'],
    ['وعد', 1, 'يَعِدُ'],
    ['وعد', 1, 'يَعِدُ'],
    ['ونى', 1, 'يَنِي'],
    ['وضع', 1, 'يَضَعُ'],
    ['وثق', 1, 'يَثُقُ'],
    ['وجز', 1, 'يَجُزُ'],
    ['وطن', 1, 'يَطِنُ'],
    ['وجب', 1, 'يَجِبُ'],
    ['وصف', 1, 'يَصِفُ'],
    ['وفد', 1, 'يَفِدُ'],
    ['ولي', 1, 'يَلِي'],
    ['وعي', 1, 'يَعِي'],
    ['وطئ', 1, 'يَطَأُ'],
    ['وهن', 1, 'يَوْهُنُ'],
    ['ودد', 1, 'يَوَدُّ'],
    ['وفي', 1, 'يَفِي'],
    ['وقي', 1, 'يَقِي'],
    ['ولى', 1, 'يَلِي'],
    ['يئس', 1, 'يَيْئَسُ'],
    ['يسر', 1, 'يَيْسُرُ'],
    ['يبس', 1, 'يَيْبَسُ'],
    ['يمن', 1, 'يَيْمَنُ'],
    ['صغر', 1, 'يَصْغُرُ'],
    ['دخل', 1, 'يَدْخُلُ'],
    ['ولد', 1, 'يَلِدُ'],
  ])('%s (%d) 3ms is %s', (root, form, expected) => {
    expect(conjugatePresentMood(getVerb(root, form), 'indicative')['3ms']).toBe(expected)
  })

  describe('regular verbs', () => {
    describe('ك-ت-ب', () => {
      test('كَتَبَ (Form I)', () => {
        expect(conjugatePresentMood(getVerb('كتب', 1), 'indicative')).toEqual({
          '1s': 'أَكْتُبُ',
          '2ms': 'تَكْتُبُ',
          '2fs': 'تَكْتُبِيْنَ',
          '3ms': 'يَكْتُبُ',
          '3fs': 'تَكْتُبُ',
          '2d': 'تَكْتُبَانِ',
          '3md': 'يَكْتُبَانِ',
          '3fd': 'تَكْتُبَانِ',
          '1p': 'نَكْتُبُ',
          '2mp': 'تَكْتُبُونَ',
          '2fp': 'تَكْتُبْنَ',
          '3mp': 'يَكْتُبُونَ',
          '3fp': 'يَكْتُبْنَ',
        })
      })

      test('كَتَّبَ (Form II)', () => {
        expect(conjugatePresentMood(getVerb('كتب', 2), 'indicative')).toEqual({
          '1s': 'أُكَتِّبُ',
          '2ms': 'تُكَتِّبُ',
          '2fs': 'تُكَتِّبِيْنَ',
          '3ms': 'يُكَتِّبُ',
          '3fs': 'تُكَتِّبُ',
          '2d': 'تُكَتِّبَانِ',
          '3md': 'يُكَتِّبَانِ',
          '3fd': 'تُكَتِّبَانِ',
          '1p': 'نُكَتِّبُ',
          '2mp': 'تُكَتِّبُونَ',
          '2fp': 'تُكَتِّبْنَ',
          '3mp': 'يُكَتِّبُونَ',
          '3fp': 'يُكَتِّبْنَ',
        })
      })

      test('كَاتَبَ (Form III)', () => {
        expect(conjugatePresentMood(getVerb('كتب', 3), 'indicative')).toEqual({
          '1s': 'أُكَاتِبُ',
          '2ms': 'تُكَاتِبُ',
          '2fs': 'تُكَاتِبِيْنَ',
          '3ms': 'يُكَاتِبُ',
          '3fs': 'تُكَاتِبُ',
          '2d': 'تُكَاتِبَانِ',
          '3md': 'يُكَاتِبَانِ',
          '3fd': 'تُكَاتِبَانِ',
          '1p': 'نُكَاتِبُ',
          '2mp': 'تُكَاتِبُونَ',
          '2fp': 'تُكَاتِبْنَ',
          '3fp': 'يُكَاتِبْنَ',
          '3mp': 'يُكَاتِبُونَ',
        })
      })

      test('أَكْتَبَ (Form IV)', () => {
        expect(conjugatePresentMood(getVerb('كتب', 4), 'indicative')).toEqual({
          '1s': 'أُكْتِبُ',
          '2ms': 'تُكْتِبُ',
          '2fs': 'تُكْتِبِيْنَ',
          '3ms': 'يُكْتِبُ',
          '3fs': 'تُكْتِبُ',
          '2d': 'تُكْتِبَانِ',
          '3md': 'يُكْتِبَانِ',
          '3fd': 'تُكْتِبَانِ',
          '1p': 'نُكْتِبُ',
          '2mp': 'تُكْتِبُونَ',
          '2fp': 'تُكْتِبْنَ',
          '3mp': 'يُكْتِبُونَ',
          '3fp': 'يُكْتِبْنَ',
        })
      })

      test('تَكَتَّبَ (Form V)', () => {
        expect(conjugatePresentMood(getVerb('كتب', 5), 'indicative')).toEqual({
          '1s': 'أَتَكَتَّبُ',
          '2ms': 'تَتَكَتَّبُ',
          '2fs': 'تَتَكَتَّبِيْنَ',
          '3ms': 'يَتَكَتَّبُ',
          '3fs': 'تَتَكَتَّبُ',
          '2d': 'تَتَكَتَّبَانِ',
          '3md': 'يَتَكَتَّبَانِ',
          '3fd': 'تَتَكَتَّبَانِ',
          '1p': 'نَتَكَتَّبُ',
          '2mp': 'تَتَكَتَّبُونَ',
          '2fp': 'تَتَكَتَّبْنَ',
          '3mp': 'يَتَكَتَّبُونَ',
          '3fp': 'يَتَكَتَّبْنَ',
        })
      })

      test('تَكَاتَبَ (Form VI)', () => {
        expect(conjugatePresentMood(getVerb('كتب', 6), 'indicative')).toEqual({
          '1s': 'أَتَكَاتَبُ',
          '2ms': 'تَتَكَاتَبُ',
          '2fs': 'تَتَكَاتَبِيْنَ',
          '3ms': 'يَتَكَاتَبُ',
          '3fs': 'تَتَكَاتَبُ',
          '2d': 'تَتَكَاتَبَانِ',
          '3md': 'يَتَكَاتَبَانِ',
          '3fd': 'تَتَكَاتَبَانِ',
          '1p': 'نَتَكَاتَبُ',
          '2mp': 'تَتَكَاتَبُونَ',
          '2fp': 'تَتَكَاتَبْنَ',
          '3fp': 'يَتَكَاتَبْنَ',
          '3mp': 'يَتَكَاتَبُونَ',
        })
      })

      test('اِنْكَتَبَ (Form VII)', () => {
        expect(conjugatePresentMood(getVerb('كتب', 7), 'indicative')).toEqual({
          '1s': 'أَنْكَتِبُ',
          '2ms': 'تَنْكَتِبُ',
          '2fs': 'تَنْكَتِبِيْنَ',
          '3ms': 'يَنْكَتِبُ',
          '3fs': 'تَنْكَتِبُ',
          '2d': 'تَنْكَتِبَانِ',
          '3md': 'يَنْكَتِبَانِ',
          '3fd': 'تَنْكَتِبَانِ',
          '1p': 'نَنْكَتِبُ',
          '2mp': 'تَنْكَتِبُونَ',
          '2fp': 'تَنْكَتِبْنَ',
          '3mp': 'يَنْكَتِبُونَ',
          '3fp': 'يَنْكَتِبْنَ',
        })
      })
    })
  })

  describe('assimilated verbs', () => {
    describe('و-ع-د', () => {
      test('وَعَدَ (Form I)', () => {
        expect(conjugatePresentMood(getVerb('وعد', 1), 'indicative')).toEqual({
          '1s': 'أَعِدُ',
          '2ms': 'تَعِدُ',
          '2fs': 'تَعِدِيْنَ',
          '3ms': 'يَعِدُ',
          '3fs': 'تَعِدُ',
          '2d': 'تَعِدَانِ',
          '3md': 'يَعِدَانِ',
          '3fd': 'تَعِدَانِ',
          '1p': 'نَعِدُ',
          '2mp': 'تَعِدُونَ',
          '2fp': 'تَعِدْنَ',
          '3mp': 'يَعِدُونَ',
          '3fp': 'يَعِدْنَ',
        })
      })

      test('تَوَعَّدَ (Form V)', () => {
        expect(conjugatePresentMood(getVerb('وعد', 5), 'indicative')).toEqual({
          '1s': 'أَتَوَعَّدُ',
          '2ms': 'تَتَوَعَّدُ',
          '2fs': 'تَتَوَعَّدِيْنَ',
          '3ms': 'يَتَوَعَّدُ',
          '3fs': 'تَتَوَعَّدُ',
          '2d': 'تَتَوَعَّدَانِ',
          '3md': 'يَتَوَعَّدَانِ',
          '3fd': 'تَتَوَعَّدَانِ',
          '1p': 'نَتَوَعَّدُ',
          '2mp': 'تَتَوَعَّدُونَ',
          '2fp': 'تَتَوَعَّدْنَ',
          '3mp': 'يَتَوَعَّدُونَ',
          '3fp': 'يَتَوَعَّدْنَ',
        })
      })
    })

    describe('و-ه-ن', () => {
      test('وَهُنَ (Form I)', () => {
        expect(conjugatePresentMood(getVerb('وهن', 1), 'indicative')).toEqual({
          '1s': 'أَوْهُنُ',
          '2ms': 'تَوْهُنُ',
          '2fs': 'تَوْهُنِيْنَ',
          '3ms': 'يَوْهُنُ',
          '3fs': 'تَوْهُنُ',
          '2d': 'تَوْهُنَانِ',
          '3md': 'يَوْهُنَانِ',
          '3fd': 'تَوْهُنَانِ',
          '1p': 'نَوْهُنُ',
          '2mp': 'تَوْهُنُونَ',
          '2fp': 'تَوْهُنَّ',
          '3mp': 'يَوْهُنُونَ',
          '3fp': 'يَوْهُنَّ',
        })
      })
    })

    describe('و-ض-ع', () => {
      test('وَضَعَ (Form I)', () => {
        expect(conjugatePresentMood(getVerb('وضع', 1), 'indicative')).toEqual({
          '1s': 'أَضَعُ',
          '2ms': 'تَضَعُ',
          '2fs': 'تَضَعِيْنَ',
          '3ms': 'يَضَعُ',
          '3fs': 'تَضَعُ',
          '2d': 'تَضَعَانِ',
          '3md': 'يَضَعَانِ',
          '3fd': 'تَضَعَانِ',
          '1p': 'نَضَعُ',
          '2mp': 'تَضَعُونَ',
          '2fp': 'تَضَعْنَ',
          '3mp': 'يَضَعُونَ',
          '3fp': 'يَضَعْنَ',
        })
      })
    })

    describe('ي-م-ن', () => {
      test('يَمَنَ (Form I)', () => {
        expect(conjugatePresentMood(getVerb('يمن', 1), 'indicative')).toEqual({
          '1s': 'أَيْمَنُ',
          '2ms': 'تَيْمَنُ',
          '2fs': 'تَيْمَنِيْنَ',
          '3ms': 'يَيْمَنُ',
          '3fs': 'تَيْمَنُ',
          '2d': 'تَيْمَنَانِ',
          '3md': 'يَيْمَنَانِ',
          '3fd': 'تَيْمَنَانِ',
          '1p': 'نَيْمَنُ',
          '2mp': 'تَيْمَنُونَ',
          '2fp': 'تَيْمَنَّ',
          '3mp': 'يَيْمَنُونَ',
          '3fp': 'يَيْمَنَّ',
        })
      })
    })
  })

  describe('hollow verbs', () => {
    describe('ك-ا-ن', () => {
      test('كَانَ (Form I) indicative', () => {
        expect(conjugatePresentMood(getVerb('كان', 1), 'indicative')).toEqual({
          '1s': 'أَكُونُ',
          '2ms': 'تَكُونُ',
          '2fs': 'تَكُونِينَ',
          '3ms': 'يَكُونُ',
          '3fs': 'تَكُونُ',
          '2d': 'تَكُونَانِ',
          '3md': 'يَكُونَانِ',
          '3fd': 'تَكُونَانِ',
          '1p': 'نَكُونُ',
          '2mp': 'تَكُونُونَ',
          '2fp': 'تَكُنَّ',
          '3mp': 'يَكُونُونَ',
          '3fp': 'يَكُنَّ',
        })
      })
    })

    describe('ش-ي-د', () => {
      test('شَادَ (Form I)', () => {
        expect(conjugatePresentMood(getVerb('شيد', 1), 'indicative')).toEqual({
          '1s': 'أَشِيدُ',
          '2ms': 'تَشِيدُ',
          '2fs': 'تَشِيدِيْنَ',
          '3ms': 'يَشِيدُ',
          '3fs': 'تَشِيدُ',
          '2d': 'تَشِيدَانِ',
          '3md': 'يَشِيدَانِ',
          '3fd': 'تَشِيدَانِ',
          '1p': 'نَشِيدُ',
          '2mp': 'تَشِيدُونَ',
          '2fp': 'تَشِدْنَ',
          '3mp': 'يَشِيدُونَ',
          '3fp': 'يَشِدْنَ',
        })
      })
    })

    describe('ج-ي-د', () => {
      test('جَيِدَ (Form I)', () => {
        expect(conjugatePresentMood(getVerb('جيد', 1), 'indicative')).toEqual({
          '1s': 'أَجْيَدُ',
          '2ms': 'تَجْيَدُ',
          '2fs': 'تَجْيَدِينَ',
          '3ms': 'يَجْيَدُ',
          '3fs': 'تَجْيَدُ',
          '2d': 'تَجْيَدَانِ',
          '3md': 'يَجْيَدَانِ',
          '3fd': 'تَجْيَدَانِ',
          '1p': 'نَجْيَدُ',
          '2mp': 'تَجْيَدُونَ',
          '2fp': 'تَجْيَدْنَ',
          '3mp': 'يَجْيَدُونَ',
          '3fp': 'يَجْيَدْنَ',
        })
      })
    })

    describe('ق-و-ل', () => {
      test('قَالَ (Form I)', () => {
        expect(conjugatePresentMood(getVerb('قول', 1), 'indicative')).toEqual({
          '1s': 'أَقُولُ',
          '2ms': 'تَقُولُ',
          '2fs': 'تَقُولِيْنَ',
          '3ms': 'يَقُولُ',
          '3fs': 'تَقُولُ',
          '2d': 'تَقُولَانِ',
          '3md': 'يَقُولَانِ',
          '3fd': 'تَقُولَانِ',
          '1p': 'نَقُولُ',
          '2mp': 'تَقُولُونَ',
          '2fp': 'تَقُلْنَ',
          '3mp': 'يَقُولُونَ',
          '3fp': 'يَقُلْنَ',
        })
      })

      test('قَوَّلَ (Form II)', () => {
        expect(conjugatePresentMood(getVerb('قول', 2), 'indicative')).toEqual({
          '1s': 'أُقَوِّلُ',
          '2ms': 'تُقَوِّلُ',
          '2fs': 'تُقَوِّلِينَ',
          '3ms': 'يُقَوِّلُ',
          '3fs': 'تُقَوِّلُ',
          '2d': 'تُقَوِّلَانِ',
          '3md': 'يُقَوِّلَانِ',
          '3fd': 'تُقَوِّلَانِ',
          '1p': 'نُقَوِّلُ',
          '2mp': 'تُقَوِّلُونَ',
          '2fp': 'تُقَوِّلْنَ',
          '3mp': 'يُقَوِّلُونَ',
          '3fp': 'يُقَوِّلْنَ',
        })
      })

      test('قَاوَلَ (Form III)', () => {
        expect(conjugatePresentMood(getVerb('قول', 3), 'indicative')).toEqual({
          '1s': 'أُقَاوِلُ',
          '2ms': 'تُقَاوِلُ',
          '2fs': 'تُقَاوِلِينَ',
          '3ms': 'يُقَاوِلُ',
          '3fs': 'تُقَاوِلُ',
          '2d': 'تُقَاوِلَانِ',
          '3md': 'يُقَاوِلَانِ',
          '3fd': 'تُقَاوِلَانِ',
          '1p': 'نُقَاوِلُ',
          '2mp': 'تُقَاوِلُونَ',
          '2fp': 'تُقَاوِلْنَ',
          '3mp': 'يُقَاوِلُونَ',
          '3fp': 'يُقَاوِلْنَ',
        })
      })

      test('تَقَوَّلَ (Form V)', () => {
        expect(conjugatePresentMood(getVerb('قول', 5), 'indicative')).toEqual({
          '1s': 'أَتَقَوَّلُ',
          '2ms': 'تَتَقَوَّلُ',
          '2fs': 'تَتَقَوَّلِينَ',
          '3ms': 'يَتَقَوَّلُ',
          '3fs': 'تَتَقَوَّلُ',
          '2d': 'تَتَقَوَّلَانِ',
          '3md': 'يَتَقَوَّلَانِ',
          '3fd': 'تَتَقَوَّلَانِ',
          '1p': 'نَتَقَوَّلُ',
          '2mp': 'تَتَقَوَّلُونَ',
          '2fp': 'تَتَقَوَّلْنَ',
          '3mp': 'يَتَقَوَّلُونَ',
          '3fp': 'يَتَقَوَّلْنَ',
        })
      })
    })
  })

  describe('defective verbs', () => {
    describe('ر-م-ي', () => {
      test('رَمَى (Form I)', () => {
        expect(conjugatePresentMood(getVerb('رمي', 1), 'indicative')).toEqual({
          '1s': 'أَرْمِي',
          '2ms': 'تَرْمِي',
          '2fs': 'تَرْمِينَ',
          '3ms': 'يَرْمِي',
          '3fs': 'تَرْمِي',
          '2d': 'تَرْمِيَانِ',
          '3md': 'يَرْمِيَانِ',
          '3fd': 'تَرْمِيَانِ',
          '1p': 'نَرْمِي',
          '2mp': 'تَرْمُونَ',
          '2fp': 'تَرْمِينَ',
          '3mp': 'يَرْمُونَ',
          '3fp': 'يَرْمِينَ',
        })
      })

      test('رَمَّى (Form II)', () => {
        expect(conjugatePresentMood(getVerb('رمي', 2), 'indicative')).toEqual({
          '1s': 'أُرَمِّي',
          '2ms': 'تُرَمِّي',
          '2fs': 'تُرَمِّينَ',
          '3ms': 'يُرَمِّي',
          '3fs': 'تُرَمِّي',
          '2d': 'تُرَمِّيَانِ',
          '3md': 'يُرَمِّيَانِ',
          '3fd': 'تُرَمِّيَانِ',
          '1p': 'نُرَمِّي',
          '2mp': 'تُرَمُّونَ',
          '2fp': 'تُرَمِّينَ',
          '3mp': 'يُرَمُّونَ',
          '3fp': 'يُرَمِّينَ',
        })
      })

      test('اِنْرَمَى (Form VII)', () => {
        expect(conjugatePresentMood(getVerb('رمي', 7), 'indicative')).toEqual({
          '1s': 'أَنْرَمِي',
          '2ms': 'تَنْرَمِي',
          '2fs': 'تَنْرَمِيْنَ',
          '3ms': 'يَنْرَمِي',
          '3fs': 'تَنْرَمِي',
          '2d': 'تَنْرَمِيَانِ',
          '3md': 'يَنْرَمِيَانِ',
          '3fd': 'تَنْرَمِيَانِ',
          '1p': 'نَنْرَمِي',
          '2mp': 'تَنْرَمِيونَ',
          '2fp': 'تَنْرَمِيْنَ',
          '3mp': 'يَنْرَمِيونَ',
          '3fp': 'يَنْرَمِيْنَ',
        })
      })
    })

    // Verified against Wiktionary's conjugation table for بَقِيَ (Form I, final-weak i~a).
    describe('ب-ق-ي', () => {
      test('بَقِيَ (Form I)', () => {
        expect(conjugatePresentMood(getVerb('بقي', 1), 'indicative')).toEqual({
          '1s': 'أَبْقَى',
          '2ms': 'تَبْقَى',
          '2fs': 'تَبْقَيْنَ',
          '3ms': 'يَبْقَى',
          '3fs': 'تَبْقَى',
          '2d': 'تَبْقَيَانِ',
          '3md': 'يَبْقَيَانِ',
          '3fd': 'تَبْقَيَانِ',
          '1p': 'نَبْقَى',
          '2mp': 'تَبْقَوْنَ',
          '2fp': 'تَبْقَيْنَ',
          '3mp': 'يَبْقَوْنَ',
          '3fp': 'يَبْقَيْنَ',
        })
      })
    })

    describe('د-ع-ا', () => {
      test('دَعَا (Form I)', () => {
        expect(conjugatePresentMood(getVerb('دعا', 1), 'indicative')).toEqual({
          '1s': 'أَدْعُو',
          '2ms': 'تَدْعُو',
          '2fs': 'تَدْعِينَ',
          '3ms': 'يَدْعُو',
          '3fs': 'تَدْعُو',
          '2d': 'تَدْعُوَانِ',
          '3md': 'يَدْعُوَانِ',
          '3fd': 'تَدْعُوَانِ',
          '1p': 'نَدْعُو',
          '2mp': 'تَدْعُونَ',
          '2fp': 'تَدْعُونَ',
          '3mp': 'يَدْعُونَ',
          '3fp': 'يَدْعُونَ',
        })
      })
    })
  })

  describe('hamzated initial hollow verbs', () => {
    describe('أ-ي-د', () => {
      test('أَيَّدَ (Form II)', () => {
        expect(conjugatePresentMood(getVerb('أيد', 2), 'indicative')).toEqual({
          '1s': 'أُؤَيِّدُ',
          '2ms': 'تُؤَيِّدُ',
          '2fs': 'تُؤَيِّدِينَ',
          '3ms': 'يُؤَيِّدُ',
          '3fs': 'تُؤَيِّدُ',
          '2d': 'تُؤَيِّدَانِ',
          '3md': 'يُؤَيِّدَانِ',
          '3fd': 'تُؤَيِّدَانِ',
          '1p': 'نُؤَيِّدُ',
          '2mp': 'تُؤَيِّدُونَ',
          '2fp': 'تُؤَيِّدْنَ',
          '3mp': 'يُؤَيِّدُونَ',
          '3fp': 'يُؤَيِّدْنَ',
        })
      })
    })
  })

  describe('hamzated initial geminate verbs', () => {
    describe('أ-م-م', () => {
      test('أَمَّ (Form I)', () => {
        expect(conjugatePresentMood(getVerb('أمم', 1), 'indicative')).toEqual({
          '1s': 'أَؤُمُّ',
          '2ms': 'تَؤُمُّ',
          '2fs': 'تَؤُمِّينَ',
          '3ms': 'يَؤُمُّ',
          '3fs': 'تَؤُمُّ',
          '2d': 'تَؤُمَّانِ',
          '3md': 'يَؤُمَّانِ',
          '3fd': 'تَؤُمَّانِ',
          '1p': 'نَؤُمُّ',
          '2mp': 'تَؤُمُّونَ',
          '2fp': 'تَأْمُمْنَ',
          '3mp': 'يَؤُمُّونَ',
          '3fp': 'يَأْمُمْنَ',
        })
      })
    })
  })

  describe('hamzated middle verbs', () => {
    describe('س-أ-ل', () => {
      test('سَأَلَ (Form I)', () => {
        expect(conjugatePresentMood(getVerb('سأل', 1), 'indicative')).toEqual({
          '1s': 'أَسْأَلُ',
          '2ms': 'تَسْأَلُ',
          '2fs': 'تَسْأَلِيْنَ',
          '3ms': 'يَسْأَلُ',
          '3fs': 'تَسْأَلُ',
          '2d': 'تَسْأَلَانِ',
          '3md': 'يَسْأَلَانِ',
          '3fd': 'تَسْأَلَانِ',
          '1p': 'نَسْأَلُ',
          '2mp': 'تَسْأَلُونَ',
          '2fp': 'تَسْأَلْنَ',
          '3mp': 'يَسْأَلُونَ',
          '3fp': 'يَسْأَلْنَ',
        })
      })

      test('سَاءَلَ (Form III)', () => {
        expect(conjugatePresentMood(getVerb('سأل', 3), 'indicative')).toEqual({
          '1s': 'أُسَائِلُ',
          '2ms': 'تُسَائِلُ',
          '2fs': 'تُسَائِلِيْنَ',
          '3ms': 'يُسَائِلُ',
          '3fs': 'تُسَائِلُ',
          '2d': 'تُسَائِلَانِ',
          '3md': 'يُسَائِلَانِ',
          '3fd': 'تُسَائِلَانِ',
          '1p': 'نُسَائِلُ',
          '2mp': 'تُسَائِلُونَ',
          '2fp': 'تُسَائِلْنَ',
          '3mp': 'يُسَائِلُونَ',
          '3fp': 'يُسَائِلْنَ',
        })
      })

      test('تَسَاءَلَ (Form VI)', () => {
        expect(conjugatePresentMood(getVerb('سأل', 6), 'indicative')).toEqual({
          '1s': 'أَتَسَاءَلُ',
          '2ms': 'تَتَسَاءَلُ',
          '2fs': 'تَتَسَاءَلِيْنَ',
          '3ms': 'يَتَسَاءَلُ',
          '3fs': 'تَتَسَاءَلُ',
          '2d': 'تَتَسَاءَلَانِ',
          '3md': 'يَتَسَاءَلَانِ',
          '3fd': 'تَتَسَاءَلَانِ',
          '1p': 'نَتَسَاءَلُ',
          '2mp': 'تَتَسَاءَلُونَ',
          '2fp': 'تَتَسَاءَلْنَ',
          '3mp': 'يَتَسَاءَلُونَ',
          '3fp': 'يَتَسَاءَلْنَ',
        })
      })
    })
  })

  describe('hamzated final verbs', () => {
    describe('ب-د-أ', () => {
      test('بَدَأَ (Form I)', () => {
        expect(conjugatePresentMood(getVerb('بدأ', 1), 'indicative')).toEqual({
          '1s': 'أَبْدَأُ',
          '2ms': 'تَبْدَأُ',
          '2fs': 'تَبْدَئِيْنَ',
          '3ms': 'يَبْدَأُ',
          '3fs': 'تَبْدَأُ',
          '2d': 'تَبْدَآنِ',
          '3md': 'يَبْدَآنِ',
          '3fd': 'تَبْدَآنِ',
          '1p': 'نَبْدَأُ',
          '2mp': 'تَبْدَأُونَ',
          '2fp': 'تَبْدَأْنَ',
          '3mp': 'يَبْدَأُونَ',
          '3fp': 'يَبْدَأْنَ',
        })
      })
    })

    describe('ق-ر-أ', () => {
      test('قَرَأَ (Form I)', () => {
        expect(conjugatePresentMood(getVerb('قرأ', 1), 'indicative')).toEqual({
          '1s': 'أَقْرَأُ',
          '2ms': 'تَقْرَأُ',
          '2fs': 'تَقْرَئِيْنَ',
          '3ms': 'يَقْرَأُ',
          '3fs': 'تَقْرَأُ',
          '2d': 'تَقْرَآنِ',
          '3md': 'يَقْرَآنِ',
          '3fd': 'تَقْرَآنِ',
          '1p': 'نَقْرَأُ',
          '2mp': 'تَقْرَأُونَ',
          '2fp': 'تَقْرَأْنَ',
          '3mp': 'يَقْرَأُونَ',
          '3fp': 'يَقْرَأْنَ',
        })
      })

      test('اِسْتَقْرَأَ (Form X)', () => {
        expect(conjugatePresentMood(getVerb('قرأ', 10), 'indicative')).toEqual({
          '1s': 'أَسْتَقْرِئُ',
          '2ms': 'تَسْتَقْرِئُ',
          '2fs': 'تَسْتَقْرِئِينَ',
          '3ms': 'يَسْتَقْرِئُ',
          '3fs': 'تَسْتَقْرِئُ',
          '2d': 'تَسْتَقْرِئَانِ',
          '3md': 'يَسْتَقْرِئَانِ',
          '3fd': 'تَسْتَقْرِئَانِ',
          '1p': 'نَسْتَقْرِئُ',
          '2mp': 'تَسْتَقْرِئُونَ',
          '2fp': 'تَسْتَقْرِئْنَ',
          '3mp': 'يَسْتَقْرِئُونَ',
          '3fp': 'يَسْتَقْرِئْنَ',
        })
      })
    })

    describe('و-ط-ء', () => {
      test('وَطِئَ (Form I)', () => {
        expect(conjugatePresentMood(getVerb('وطئ', 1), 'indicative')).toEqual({
          '1s': 'أَطَأُ',
          '2ms': 'تَطَأُ',
          '2fs': 'تَطَئِيْنَ',
          '3ms': 'يَطَأُ',
          '3fs': 'تَطَأُ',
          '2d': 'تَطَآنِ',
          '3md': 'يَطَآنِ',
          '3fd': 'تَطَآنِ',
          '1p': 'نَطَأُ',
          '2mp': 'تَطَأُونَ',
          '2fp': 'تَطَأْنَ',
          '3mp': 'يَطَأُونَ',
          '3fp': 'يَطَأْنَ',
        })
      })
    })
  })

  describe('doubly weak verbs', () => {
    describe('و-ف-ي', () => {
      test('وَفَى (Form I)', () => {
        expect(conjugatePresentMood(getVerb('وفي', 1), 'indicative')).toEqual({
          '1s': 'أَفِي',
          '2ms': 'تَفِي',
          '2fs': 'تَفِيْنَ',
          '3ms': 'يَفِي',
          '3fs': 'تَفِي',
          '2d': 'تَفَانِ',
          '3md': 'يَفَانِ',
          '3fd': 'تَفَانِ',
          '1p': 'نَفِي',
          '2mp': 'تَفونَ',
          '2fp': 'تَفِيْنَ',
          '3mp': 'يَفونَ',
          '3fp': 'يَفِيْنَ',
        })
      })

      test('وَفَّى (Form II)', () => {
        expect(conjugatePresentMood(getVerb('وفي', 2), 'indicative')).toEqual({
          '1s': 'أُوَفِّي',
          '2ms': 'تُوَفِّي',
          '2fs': 'تُوَفِّينَ',
          '3ms': 'يُوَفِّي',
          '3fs': 'تُوَفِّي',
          '2d': 'تُوَفِّيَانِ',
          '3md': 'يُوَفِّيَانِ',
          '3fd': 'تُوَفِّيَانِ',
          '1p': 'نُوَفِّي',
          '2mp': 'تُوَفُّونَ',
          '2fp': 'تُوَفِّينَ',
          '3mp': 'يُوَفُّونَ',
          '3fp': 'يُوَفِّينَ',
        })
      })

      test('وَافَى (Form III)', () => {
        expect(conjugatePresentMood(getVerb('وفي', 3), 'indicative')).toEqual({
          '1s': 'أُوَافِيُ',
          '2ms': 'تُوَافِيُ',
          '2fs': 'تُوَافِيْنَ',
          '3ms': 'يُوَافِيُ',
          '3fs': 'تُوَافِيُ',
          '2d': 'تُوَافَانِ',
          '3md': 'يُوَافَانِ',
          '3fd': 'تُوَافَانِ',
          '1p': 'نُوَافِيُ',
          '2mp': 'تُوَافونَ',
          '2fp': 'تُوَافِيْنَ',
          '3mp': 'يُوَافونَ',
          '3fp': 'يُوَافِيْنَ',
        })
      })

      test('أَوْفَى (Form IV)', () => {
        expect(conjugatePresentMood(getVerb('وفي', 4), 'indicative')).toEqual({
          '1s': 'أُوْفِي',
          '2ms': 'تُوْفِي',
          '2fs': 'تُوْفِيْنَ',
          '3ms': 'يُوْفِي',
          '3fs': 'تُوْفِي',
          '2d': 'تُوْفَانِ',
          '3md': 'يُوْفَانِ',
          '3fd': 'تُوْفَانِ',
          '1p': 'نُوْفِي',
          '2mp': 'تُوْفونَ',
          '2fp': 'تُوْفِيْنَ',
          '3mp': 'يُوْفونَ',
          '3fp': 'يُوْفِيْنَ',
        })
      })

      test('تَوَفَّى (Form V)', () => {
        expect(conjugatePresentMood(getVerb('وفي', 5), 'indicative')).toEqual({
          '1s': 'أَتَوَفَّى',
          '2ms': 'تَتَوَفَّى',
          '2fs': 'تَتَوَفَّيْنَ',
          '3ms': 'يَتَوَفَّى',
          '3fs': 'تَتَوَفَّى',
          '2d': 'تَتَوَفَّيَانِ',
          '3md': 'يَتَوَفَّيَانِ',
          '3fd': 'تَتَوَفَّيَانِ',
          '1p': 'نَتَوَفَّى',
          '2mp': 'تَتَوَفَّوْنَ',
          '2fp': 'تَتَوَفَّيْنَ',
          '3mp': 'يَتَوَفَّوْنَ',
          '3fp': 'يَتَوَفَّيْنَ',
        })
      })

      test('اِسْتَوْفَى (Form X)', () => {
        expect(conjugatePresentMood(getVerb('وفي', 10), 'indicative')).toEqual({
          '1s': 'أَسْتَوْفِيُ',
          '2ms': 'تَسْتَوْفِيُ',
          '2fs': 'تَسْتَوْفِيْنَ',
          '3ms': 'يَسْتَوْفِيُ',
          '3fs': 'تَسْتَوْفِيُ',
          '2d': 'تَسْتَوْفَانِ',
          '3md': 'يَسْتَوْفَانِ',
          '3fd': 'تَسْتَوْفَانِ',
          '1p': 'نَسْتَوْفِيُ',
          '2mp': 'تَسْتَوْفونَ',
          '2fp': 'تَسْتَوْفِيْنَ',
          '3mp': 'يَسْتَوْفونَ',
          '3fp': 'يَسْتَوْفِيْنَ',
        })
      })
    })

    describe('ر-و-ي', () => {
      test('رَوِيَ (Form I)', () => {
        expect(conjugatePresentMood(getVerb('روي', 1), 'indicative')).toEqual({
          '1s': 'أَرْوِي',
          '2ms': 'تَرْوِي',
          '2fs': 'تَرْوِينَ',
          '3ms': 'يَرْوِي',
          '3fs': 'تَرْوِي',
          '2d': 'تَرْوِيَانِ',
          '3md': 'يَرْوِيَانِ',
          '3fd': 'تَرْوِيَانِ',
          '1p': 'نَرْوِي',
          '2mp': 'تَرْوُونَ',
          '2fp': 'تَرْوِينَ',
          '3mp': 'يَرْوُونَ',
          '3fp': 'يَرْوِينَ',
        })
      })
    })
  })

  describe('geminate verbs', () => {
    describe('ح-م-م', () => {
      test('اِسْتَحَمَّ (Form X)', () => {
        expect(conjugatePresentMood(getVerb('حمم', 10), 'indicative')).toEqual({
          '1s': 'أَسْتَحِمُّ',
          '2ms': 'تَسْتَحِمُّ',
          '2fs': 'تَسْتَحِمِّيْنَ',
          '3ms': 'يَسْتَحِمُّ',
          '3fs': 'تَسْتَحِمُّ',
          '2d': 'تَسْتَحِمَّانِ',
          '3md': 'يَسْتَحِمَّانِ',
          '3fd': 'تَسْتَحِمَّانِ',
          '1p': 'نَسْتَحِمُّ',
          '2mp': 'تَسْتَحِمُّونَ',
          '2fp': 'تَسْتَحْمِمْنَ',
          '3mp': 'يَسْتَحِمُّونَ',
          '3fp': 'يَسْتَحْمِمْنَ',
        })
      })
    })

    describe('ح-ب-ب', () => {
      test('حَبَّ (Form I)', () => {
        expect(conjugatePresentMood(getVerb('حبب', 1), 'indicative')).toEqual({
          '1s': 'أَحِبُّ',
          '2ms': 'تَحِبُّ',
          '2fs': 'تَحِبِّيْنَ',
          '3ms': 'يَحِبُّ',
          '3fs': 'تَحِبُّ',
          '2d': 'تَحِبَّانِ',
          '3md': 'يَحِبَّانِ',
          '3fd': 'تَحِبَّانِ',
          '1p': 'نَحِبُّ',
          '2mp': 'تَحِبُّونَ',
          '2fp': 'تَحْبِبْنَ',
          '3mp': 'يَحِبُّونَ',
          '3fp': 'يَحْبِبْنَ',
        })
      })

      test('تَحَابَّ (Form VI)', () => {
        expect(conjugatePresentMood(getVerb('حبب', 6), 'indicative')).toEqual({
          '1s': 'أَتَحَابُّ',
          '2ms': 'تَتَحَابُّ',
          '2fs': 'تَتَحَابِّيْنَ',
          '3ms': 'يَتَحَابُّ',
          '3fs': 'تَتَحَابُّ',
          '2d': 'تَتَحَابَّانِ',
          '3md': 'يَتَحَابَّانِ',
          '3fd': 'تَتَحَابَّانِ',
          '1p': 'نَتَحَابُّ',
          '2mp': 'تَتَحَابُّونَ',
          '2fp': 'تَتَحَابَبْنَ',
          '3mp': 'يَتَحَابُّونَ',
          '3fp': 'يَتَحَابَبْنَ',
        })
      })
    })

    describe('ق-ر-ر', () => {
      test('قَرَّ (Form I)', () => {
        expect(conjugatePresentMood(getVerb('قرر', 1), 'indicative')).toEqual({
          '1s': 'أَقَرُّ',
          '2ms': 'تَقَرُّ',
          '2fs': 'تَقَرِّيْنَ',
          '3ms': 'يَقَرُّ',
          '3fs': 'تَقَرُّ',
          '2d': 'تَقَرَّانِ',
          '3md': 'يَقَرَّانِ',
          '3fd': 'تَقَرَّانِ',
          '1p': 'نَقَرُّ',
          '2mp': 'تَقَرُّونَ',
          '2fp': 'تَقْرَرْنَ',
          '3mp': 'يَقَرُّونَ',
          '3fp': 'يَقْرَرْنَ',
        })
      })
    })

    describe('ظ-ل-ل', () => {
      test('ظَلَّ (Form I)', () => {
        expect(conjugatePresentMood(getVerb('ظلل', 1), 'indicative')).toEqual({
          '1s': 'أَظَلُّ',
          '2ms': 'تَظَلُّ',
          '2fs': 'تَظَلِّيْنَ',
          '3ms': 'يَظَلُّ',
          '3fs': 'تَظَلُّ',
          '2d': 'تَظَلَّانِ',
          '3md': 'يَظَلَّانِ',
          '3fd': 'تَظَلَّانِ',
          '1p': 'نَظَلُّ',
          '2mp': 'تَظَلُّونَ',
          '2fp': 'تَظْلَلْنَ',
          '3mp': 'يَظَلُّونَ',
          '3fp': 'يَظْلَلْنَ',
        })
      })
    })
  })

  describe('hamzated initial defective verbs', () => {
    describe('أ-ت-ي', () => {
      test('أَتَى (Form I)', () => {
        expect(conjugatePresentMood(getVerb('أتي', 1), 'indicative')).toEqual({
          '1s': 'آتِي',
          '2ms': 'تَأْتِي',
          '2fs': 'تَأْتِينَ',
          '3ms': 'يَأْتِي',
          '3fs': 'تَأْتِي',
          '2d': 'تَأْتِيَانِ',
          '3md': 'يَأْتِيَانِ',
          '3fd': 'تَأْتِيَانِ',
          '1p': 'نَأْتِي',
          '2mp': 'تَأْتُونَ',
          '2fp': 'تَأْتِينَ',
          '3mp': 'يَأْتُونَ',
          '3fp': 'يَأْتِينَ',
        })
      })
    })
  })

  describe('hamzated middle assimilated verbs', () => {
    describe.todo('و-ئ-د')
  })

  describe('hamzated middle defective verbs', () => {
    describe('ر-أ-ى', () => {
      test('رَأَى (Form I)', () => {
        expect(conjugatePresentMood(getVerb('رأى', 1), 'indicative')).toEqual({
          '1s': 'أَرَى',
          '2ms': 'تَرَى',
          '2fs': 'تَرَيْنَ',
          '3ms': 'يَرَى',
          '3fs': 'تَرَى',
          '2d': 'تَرَيَانِ',
          '3md': 'يَرَيَانِ',
          '3fd': 'تَرَيَانِ',
          '1p': 'نَرَى',
          '2mp': 'تَرَوْنَ',
          '2fp': 'تَرَيْنَ',
          '3mp': 'يَرَوْنَ',
          '3fp': 'يَرَيْنَ',
        })
      })
    })
  })

  describe('hamzated final assimilated verbs', () => {
    describe('و-أ-ى', () => {
      test('وَأَى (Form I)', () => {
        expect(conjugatePresentMood(getVerb('وأى', 1), 'indicative')).toEqual({
          '1s': 'أَئِي',
          '2ms': 'تَئِي',
          '2fs': 'تَئِينَ',
          '3ms': 'يَئِي',
          '3fs': 'تَئِي',
          '2d': 'تَئِيَانِ',
          '3md': 'يَئِيَانِ',
          '3fd': 'تَئِيَانِ',
          '1p': 'نَئِي',
          '2mp': 'تَأُونَ',
          '2fp': 'تَئِينَ',
          '3mp': 'يَأُونَ',
          '3fp': 'يَئِينَ',
        })
      })
    })
  })

  describe('hamzated final hollow verbs', () => {
    describe('ج-ي-ء', () => {
      test('جَاءَ (Form I)', () => {
        expect(conjugatePresentMood(getVerb('جيء', 1), 'indicative')).toEqual({
          '1s': 'أَجِيءُ',
          '2ms': 'تَجِيءُ',
          '2fs': 'تَجِيئِينَ',
          '3ms': 'يَجِيءُ',
          '3fs': 'تَجِيءُ',
          '2d': 'تَجِيئَانِ',
          '3md': 'يَجِيئَانِ',
          '3fd': 'تَجِيئَانِ',
          '1p': 'نَجِيءُ',
          '2mp': 'تَجِيئُونَ',
          '2fp': 'تَجِئْنَ',
          '3mp': 'يَجِيئُونَ',
          '3fp': 'يَجِئْنَ',
        })
      })
    })
  })
})
