import { describe, expect, test } from 'vitest'
import { getVerb, type VerbForm } from '../verbs'
import { deriveMasdar } from './masdar'

test.each<[string, VerbForm, string | string[]]>([
  ['أتي', 1, 'إِتْيَان'],
  ['أجر', 10, 'اِسْتِئْجَار'],
  ['أمر', 1, 'أَمْر'],
  ['أمن', 1, 'أَمْن'],
  ['أذن', 1, 'أَذَن'],
  ['أمم', 1, 'أَمّ'],
  ['أسر', 1, 'أَسْر'],
  ['أخذ', 1, 'أَخْذ'],
  ['أمن', 4, 'إِيمَان'],
  ['أكد', 2, 'تَأْكِيد'],
  ['أود', 2, 'تَأْوِيد'],
  ['أيد', 2, 'تَأْيِيد'],
  ['أثر', 2, 'تَأْثِير'],
  ['أنشأ', 4, 'إِنْشَاء'],
  ['أوي', 1, 'إِوِيّ'],
  ['أوي', 10, 'اِسْتِئْواء'],
  ['أوي', 4, 'إِيوَاء'],
  ['أوي', 5, 'تَأَوِّي'],
  ['عمل', 1, 'عَمَل'],
  ['عمل', 2, 'تَعْمِيل'],
  ['عمل', 10, 'اِسْتِعْمَال'],
  ['مكن', 4, 'إِمْكَان'],
  ['بدأ', 1, 'بَدْء'],
  ['بدل', 1, 'بَدْل'],
  ['بدل', 2, 'تَبْدِيل'],
  ['بقي', 1, 'بَقَاء'],
  ['بكي', 1, 'بُكَاء'],
  ['ترجم', 1, 'تَرْجَمَة'],
  ['جعل', 1, 'جَعْل'],
  ['جلس', 1, 'جُلُوس'],
  ['جمع', 1, 'جَمْع'],
  ['جمع', 2, 'تَجْمِيع'],
  ['جيء', 1, 'مَجِيء'],
  ['جيء', 6, 'تَجَاءٍ'],
  ['حدث', 1, 'حُدُوث'],
  ['حبط', 1, 'حُبُوط'],
  ['تمم', 1, 'تَمّ'],
  ['قرح', 8, 'اِقْتِرَاح'],
  ['ذكر', 1, 'ذِكْر'],
  ['ذكر', 2, 'تَذْكِير'],
  ['ضمن', 1, 'ضَمَان'],
  ['ضمن', 2, 'تَضْمِين'],
  ['ضمن', 5, 'تَضَمُّن'],
  ['صبح', 2, 'تَصْبِيح'],
  ['جمع', 5, 'تَجَمُّع'],
  ['طلب', 5, 'تَطَلُّب'],
  ['حسب', 1, 'حَسَب'],
  ['حضر', 1, 'حُضُور'],
  ['حلق', 1, 'حَلْق'],
  ['حلم', 1, 'حُلْم'],
  ['حمر', 9, 'اِحْمِرَار'],
  ['حمم', 10, 'اِسْتِحْمَام'],
  ['حبب', 1, 'حُبّ'],
  ['حبب', 2, 'تَحْبِيب'],
  ['حبب', 4, 'إِحْبَاب'],
  ['حبب', 5, 'تَحَبُّب'],
  ['حبب', 6, 'تَحَابُب'],
  ['حبب', 10, 'اِسْتِحْبَاب'],
  ['خرج', 1, 'خُرُوج'],
  ['خسر', 1, 'خُسْر'],
  ['جري', 1, 'جَرْي'],
  ['جبب', 1, 'جَبّ'],
  ['درس', 1, 'دَرْس'],
  ['درس', 10, 'اِسْتِدْرَاس'],
  ['دعى', 10, 'اِسْتِدْعَاء'],
  ['رأى', 1, 'رُؤْيَة'],
  ['ركز', 1, 'رَكْز'],
  ['سعد', 1, 'سَعَادَة'],
  ['سفر', 1, 'سَفْر'],
  ['صبح', 1, 'صَبْح'],
  ['صبح', 4, 'إِصْبَاح'],
  ['صبر', 1, 'صَبْر'],
  ['صدق', 1, 'صِدْق'],
  ['صرح', 1, 'صَرْح'],
  ['صرخ', 1, 'صُرَاخ'],
  ['صرف', 1, 'صَرْف'],
  ['صعد', 1, 'صُعُود'],
  ['صفر', 9, 'اِصْفِرَار'],
  ['ضيف', 10, 'اِسْتِضَافَة'],
  ['ضيف', 4, 'إِضَافَة'],
  ['طير', 2, 'تَطْيِير'],
  ['عاد', 10, 'اِسْتِعَادَة'],
  ['عدد', 4, 'إِعْدَاد'],
  ['عطى', 4, 'إِعْطَاء'],
  ['عون', 10, 'اِسْتِعَانَة'],
  ['عون', 3, 'مُعَاوَنَة'],
  ['عون', 4, 'إِعَانَة'],
  ['عون', 6, 'تَعَاوُن'],
  ['عنن', 1, 'عَنّ'],
  ['غدو', 1, 'غُدُوّ'],
  ['لوم', 1, 'لَوْم'],
  ['غنى', 10, 'اِسْتِغْنَاء'],
  ['غنى', 2, 'تَغْنِيَة'],
  ['غنى', 5, 'تَغَنٍّ'],
  ['فجر', 7, 'اِنْفِجَار'],
  ['فعل', 1, 'فِعْل'],
  ['فعل', 2, 'تَفْعِيل'],
  ['فعل', 4, 'إِفْعَال'],
  ['فلت', 4, 'إِفْلَات'],
  ['قتل', 1, 'قَتْل'],
  ['قرأ', 1, 'قِرَاءَة'],
  ['قرر', 4, 'إِقْرَار'],
  ['قرر', 1, 'قَرَار'],
  ['أخذ', 8, 'اِتِّخَاذ'],
  ['قسم', 1, 'قِسْمَة'],
  ['قفز', 1, 'قَفْز'],
  ['قود', 3, 'مُقَاوَدَة'],
  ['قود', 4, 'إِقَادَة'],
  ['قود', 7, 'اِنْقِيَاد'],
  ['قود', 8, 'اِقْتِيَاد'],
  ['قوم', 1, 'قِيَام'],
  ['كان', 1, 'كَوْن'],
  ['كتب', 1, 'كِتَابَة'],
  ['كسر', 1, 'كَسْر'],
  ['مرض', 1, 'مَرَض'],
  ['مثل', 1, 'مُثُول'],
  ['نبأ', 4, 'إِنْبَاء'],
  ['نهي', 4, 'إِنْهَاء'],
  ['نهي', 8, 'اِنْتِهَاء'],
  ['هجر', 1, 'هَجْر'],
  ['وصل', 1, 'وَصْل'],
  ['وصل', 8, 'اِتِّصَال'],
  ['ودد', 1, 'وُدّ'],
  ['وفي', 1, 'وَفَاء'],
  ['وفي', 10, 'اِسْتِفَاء'],
  ['وفي', 4, 'إِيفَاء'],
  ['وقي', 1, 'وِقَايَة'],
  ['وضع', 1, 'وَضْع'],
  ['وأى', 1, 'وَأْي'],
  ['ولى', 1, 'وِلَايَة'],
  ['باع', 1, 'بَيْع'],
  ['زور', 1, 'زَوْر'],
  ['دعا', 1, 'دُعَاء'],
  ['يئس', 1, 'يَأْس'],
  ['يسر', 1, 'يَسْر'],
  ['مسي', 4, 'إِمْسَاء'],
  ['ضحي', 4, 'إِضْحَاء'],
  ['دخل', 1, 'دُخُول'],
  ['ولد', 1, 'وِلادَة'],
  ['ذهب', 1, 'ذَهَاب'],
  ['بيت', 1, 'مَبِيت'],
  ['صير', 1, 'صَيْر'],
  ['راح', 1, 'رَوَاح'],
  ['طلب', 1, 'طَلَب'],
  ['لعب', 1, 'لُعْب'],
  ['ظلل', 1, 'ظَلّ'],
  ['حول', 5, 'تَحَوُّل'],
  ['وطن', 1, 'وَطْن'],
  ['وجب', 1, 'وُجُوب'],
  ['وصف', 1, 'وَصْف'],
  ['وفد', 1, 'وُفُود'],
  ['ولي', 1, 'وَلْي'],
  ['وطئ', 1, 'وَطْء'],
  ['وعي', 1, 'وَعْي'],
  ['وهن', 1, 'وَهْن'],
])('%s (Form %d) masdar is %s', (root, form, expected) => {
  expect(deriveMasdar(getVerb(root, form))).toEqual([expected].flat())
})

describe('masdar patterns', () => {
  // Source: https://ar.wikipedia.org/wiki/مصدر_ميمي
  test.each([
    ['شرب', ['شُرْب', 'مَشْرَب']],
    ['وعد', ['وَعْد', 'مَوْعِد']],
  ])('%s supports multiple masdar patterns', (root, expected) => {
    expect(deriveMasdar(getVerb(root, 1))).toEqual(expected)
  })

  test.each([
    ['بيت', ['مَبِيت']],
    ['سعى', ['مَسْعَى']],
  ])('%s uses the expected masdar mimi form', (root, expected) => {
    expect(deriveMasdar(getVerb(root, 1))).toEqual(expected)
  })

  test.each(['لمم', 'روي', 'شيد', 'يمن', 'يبس', 'وثق', 'وجز', 'هلل'])('%s has no masdar', (root) => {
    expect(deriveMasdar(getVerb(root, 1))).toEqual([])
  })
})

describe('regular roots', () => {
  describe('ك-ت-ب', () => {
    test.each<[VerbForm, string]>([
      [1, 'كِتَابَة'],
      [2, 'تَكْتِيب'],
      [3, 'مُكَاتَبَة'],
      [4, 'إِكْتَاب'],
      [5, 'تَكَتُّب'],
      [6, 'تَكَاتُب'],
      [7, 'اِنْكِتَاب'],
    ])('Form %d masdar is %s', (form, expected) => {
      expect(deriveMasdar(getVerb('كتب', form))).toEqual([expected])
    })
  })
})

describe('assimilated roots', () => {
  describe('و-ع-د', () => {
    test.each<[VerbForm, string | readonly string[]]>([
      [1, ['وَعْد', 'مَوْعِد']],
      [5, ['تَوَعُّد']],
    ])('Form %d masdar is %s', (form, expected) => {
      expect(deriveMasdar(getVerb('وعد', form))).toEqual(expected)
    })
  })
})

describe('hollow roots', () => {
  describe('ق-و-ل', () => {
    test.each<[VerbForm, string]>([
      [1, 'قَوْل'],
      [2, 'تَقْوِيل'],
      [3, 'مُقَاوَلَة'],
      [5, 'تَقَوُّل'],
    ])('Form %d masdar is %s', (form, expected) => {
      expect(deriveMasdar(getVerb('قول', form))).toEqual([expected])
    })
  })
})

describe.todo('defective roots')

describe('hamzated initial roots', () => {
  describe('أ-ك-ل', () => {
    test.each<[VerbForm, string]>([[1, 'أَكْل']])('Form %d active participle is %s', (form, expected) => {
      expect(deriveMasdar(getVerb('أكل', form))).toEqual([expected])
    })
  })
})

describe('hamzated middle roots', () => {
  describe('س-أ-ل', () => {
    test.each<[VerbForm, readonly string[]]>([
      [1, ['سُؤَال']],
      [3, ['مُسَاءَلَة']],
      [6, ['تَسَاؤُل']],
    ])('Form %d masdar is %s', (form, expected) => {
      expect(deriveMasdar(getVerb('سأل', form))).toEqual(expected)
    })
  })

  describe('ي-ئ-س', () => {
    test.each<[VerbForm, readonly string[]]>([[1, ['يَأْس']]])('Form %d masdar is %s', (form, expected) => {
      expect(deriveMasdar(getVerb('يئس', form))).toEqual(expected)
    })
  })
})

describe('hamzated final roots', () => {
  describe('ق-ر-أ', () => {
    test.each<[VerbForm, readonly string[]]>([
      [1, ['قِرَاءَة']],
      [10, ['اِسْتِقْرَاء']],
    ])('Form %d masdar is %s', (form, expected) => {
      expect(deriveMasdar(getVerb('قرأ', form))).toEqual(expected)
    })
  })
})

describe('doubly weak roots', () => {
  describe('و-ف-ي', () => {
    test.each<[VerbForm, string]>([
      [1, 'وَفَاء'],
      [2, 'تَوْفِيَة'],
      [3, 'مُوَافَاءة'],
      [4, 'إِيفَاء'],
      [5, 'تَوَفٍّ'],
      [10, 'اِسْتِفَاء'],
    ])('Form %d masdar is %s', (form, expected) => {
      expect(deriveMasdar(getVerb('وفي', form))).toEqual([expected])
    })
  })
})

describe.todo('hamzated initial defective roots')

describe.todo('hamzated middle assimilated roots')

describe.todo('hamzated middle defective roots')

describe.todo('hamzated final assimilated roots')

describe.todo('hamzated final hollow roots')
