import { describe, expect, test } from 'vitest'
import { getVerb } from '../verbs'
import { conjugatePassivePast } from './past'

describe('passive past', () => {
  describe('strong roots', () => {
    test('كَتَبَ (Form I)', () => {
      expect(conjugatePassivePast(getVerb('كتب', 1))).toEqual({
        '1s': 'كُتِبْتُ',
        '2ms': 'كُتِبْتَ',
        '2fs': 'كُتِبْتِ',
        '3ms': 'كُتِبَ',
        '3fs': 'كُتِبَتْ',
        '2d': 'كُتِبْتُمَا',
        '3md': 'كُتِبَا',
        '3fd': 'كُتِبَتَا',
        '1p': 'كُتِبْنَا',
        '2mp': 'كُتِبْتُمْ',
        '2fp': 'كُتِبْتُنَّ',
        '3mp': 'كُتِبُوا',
        '3fp': 'كُتِبْنَ',
      })
    })

    test('وَقَفَ (Form I)', () => {
      expect(conjugatePassivePast(getVerb('وقف', 1))).toEqual({
        '1s': 'وُقِفْتُ',
        '2ms': 'وُقِفْتَ',
        '2fs': 'وُقِفْتِ',
        '3ms': 'وُقِفَ',
        '3fs': 'وُقِفَتْ',
        '2d': 'وُقِفْتُمَا',
        '3md': 'وُقِفَا',
        '3fd': 'وُقِفَتَا',
        '1p': 'وُقِفْنَا',
        '2mp': 'وُقِفْتُمْ',
        '2fp': 'وُقِفْتُنَّ',
        '3mp': 'وُقِفُوا',
        '3fp': 'وُقِفْنَ',
      })
    })
  })

  describe('geminate roots', () => {
    test('لَمَّ (Form I)', () => {
      expect(conjugatePassivePast(getVerb('لمم', 1))).toEqual({
        '1s': 'لُمِمْتُ',
        '2ms': 'لُمِمْتَ',
        '2fs': 'لُمِمْتِ',
        '3ms': 'لُمَّ',
        '3fs': 'لُمَّتْ',
        '2d': 'لُمِمْتُمَا',
        '3md': 'لُمَّا',
        '3fd': 'لُمَّتَا',
        '1p': 'لُمِمْنَا',
        '2mp': 'لُمِمْتُمْ',
        '2fp': 'لُمِمْتُنَّ',
        '3mp': 'لُمُّوا',
        '3fp': 'لُمِمْنَ',
      })
    })

    test('وَدَّ (Form I)', () => {
      expect(conjugatePassivePast(getVerb('ودد', 1))).toEqual({
        '1s': 'وُدِدْتُ',
        '2ms': 'وُدِدْتَ',
        '2fs': 'وُدِدْتِ',
        '3ms': 'وُدَّ',
        '3fs': 'وُدَّتْ',
        '2d': 'وُدِدْتُمَا',
        '3md': 'وُدَّا',
        '3fd': 'وُدَّتَا',
        '1p': 'وُدِدْنَا',
        '2mp': 'وُدِدْتُمْ',
        '2fp': 'وُدِدْتُنَّ',
        '3mp': 'وُدُّوا',
        '3fp': 'وُدِدْنَ',
      })
    })
  })

  describe('assimilated roots', () => {
    test('يَمَنَ (Form I)', () => {
      expect(conjugatePassivePast(getVerb('يمن', 1))).toEqual({
        '1s': 'يُمِنْتُ',
        '2ms': 'يُمِنْتَ',
        '2fs': 'يُمِنْتِ',
        '3ms': 'يُمِنَ',
        '3fs': 'يُمِنَتْ',
        '2d': 'يُمِنْتُمَا',
        '3md': 'يُمِنَا',
        '3fd': 'يُمِنَتَا',
        '1p': 'يُمِنَّا',
        '2mp': 'يُمِنْتُمْ',
        '2fp': 'يُمِنْتُنَّ',
        '3mp': 'يُمِنُوا',
        '3fp': 'يُمِنَّ',
      })
    })
  })

  describe('hollow roots', () => {
    test('لَامَ (Form I)', () => {
      expect(conjugatePassivePast(getVerb('لوم', 1))).toEqual({
        '1s': 'لِمْتُ',
        '2ms': 'لِمْتَ',
        '2fs': 'لِمْتِ',
        '3ms': 'لِيمَ',
        '3fs': 'لِيمَتْ',
        '2d': 'لِمْتُمَا',
        '3md': 'لِيمَا',
        '3fd': 'لِيمَتَا',
        '1p': 'لِمْنَا',
        '2mp': 'لِمْتُمْ',
        '2fp': 'لِمْتُنَّ',
        '3mp': 'لِيمُوا',
        '3fp': 'لِمْنَ',
      })
    })

    test('بَاعَ (Form I)', () => {
      expect(conjugatePassivePast(getVerb('باع', 1))).toEqual({
        '1s': 'بِعْتُ',
        '2ms': 'بِعْتَ',
        '2fs': 'بِعْتِ',
        '3ms': 'بِيعَ',
        '3fs': 'بِيعَتْ',
        '2d': 'بِعْتُمَا',
        '3md': 'بِيعَا',
        '3fd': 'بِيعَتَا',
        '1p': 'بِعْنَا',
        '2mp': 'بِعْتُمْ',
        '2fp': 'بِعْتُنَّ',
        '3mp': 'بِيعُوا',
        '3fp': 'بِعْنَ',
      })
    })

    test('زَارَ (Form I)', () => {
      expect(conjugatePassivePast(getVerb('زور', 1))).toEqual({
        '1s': 'زِرْتُ',
        '2ms': 'زِرْتَ',
        '2fs': 'زِرْتِ',
        '3ms': 'زِيرَ',
        '3fs': 'زِيرَتْ',
        '2d': 'زِرْتُمَا',
        '3md': 'زِيرَا',
        '3fd': 'زِيرَتَا',
        '1p': 'زِرْنَا',
        '2mp': 'زِرْتُمْ',
        '2fp': 'زِرْتُنَّ',
        '3mp': 'زِيرُوا',
        '3fp': 'زِرْنَ',
      })
    })

    test('شَادَ (Form I)', () => {
      expect(conjugatePassivePast(getVerb('شيد', 1))).toEqual({
        '1s': 'شِدْتُ',
        '2ms': 'شِدْتَ',
        '2fs': 'شِدْتِ',
        '3ms': 'شِيدَ',
        '3fs': 'شِيدَتْ',
        '2d': 'شِدْتُمَا',
        '3md': 'شِيدَا',
        '3fd': 'شِيدَتَا',
        '1p': 'شِدْنَا',
        '2mp': 'شِدْتُمْ',
        '2fp': 'شِدْتُنَّ',
        '3mp': 'شِيدُوا',
        '3fp': 'شِدْنَ',
      })
    })
  })

  describe('hamzated initial roots', () => {
    test('أَخَذَ (Form I)', () => {
      expect(conjugatePassivePast(getVerb('أخذ', 1))).toEqual({
        '1s': 'أُخِذْتُ',
        '2ms': 'أُخِذْتَ',
        '2fs': 'أُخِذْتِ',
        '3ms': 'أُخِذَ',
        '3fs': 'أُخِذَتْ',
        '2d': 'أُخِذْتُمَا',
        '3md': 'أُخِذَا',
        '3fd': 'أُخِذَتَا',
        '1p': 'أُخِذْنَا',
        '2mp': 'أُخِذْتُمْ',
        '2fp': 'أُخِذْتُنَّ',
        '3mp': 'أُخِذُوا',
        '3fp': 'أُخِذْنَ',
      })
    })
  })

  describe('hamzated initial doubly weak roots', () => {
    test('أَوَى (Form I)', () => {
      expect(conjugatePassivePast(getVerb('أوي', 1))).toEqual({
        '1s': 'أُوِيتُ',
        '2ms': 'أُوِيتَ',
        '2fs': 'أُوِيتِ',
        '3ms': 'أُوِيَ',
        '3fs': 'أُوِيَتْ',
        '2d': 'أُوِيتُمَا',
        '3md': 'أُوِيَا',
        '3fd': 'أُوِيَتَا',
        '1p': 'أُوِينَا',
        '2mp': 'أُوِيتُمْ',
        '2fp': 'أُوِيتُنَّ',
        '3mp': 'أُوُوا',
        '3fp': 'أُوِينَ',
      })
    })
  })

  describe('hamzated middle defective roots', () => {
    test('رَأَى (Form I)', () => {
      expect(conjugatePassivePast(getVerb('رأى', 1))).toEqual({
        '1s': 'رُئِيتُ',
        '2ms': 'رُئِيتَ',
        '2fs': 'رُئِيتِ',
        '3ms': 'رُئِيَ',
        '3fs': 'رُئِيَتْ',
        '2d': 'رُئِيتُمَا',
        '3md': 'رُئِيَا',
        '3fd': 'رُئِيَتَا',
        '1p': 'رُئِينَا',
        '2mp': 'رُئِيتُمْ',
        '2fp': 'رُئِيتُنَّ',
        '3mp': 'رُؤُوا',
        '3fp': 'رُئِينَ',
      })
    })
  })

  describe('defective roots', () => {
    test('دَعَا (Form I)', () => {
      expect(conjugatePassivePast(getVerb('دعا', 1))).toEqual({
        '1s': 'دُعِيتُ',
        '2ms': 'دُعِيتَ',
        '2fs': 'دُعِيتِ',
        '3ms': 'دُعِيَ',
        '3fs': 'دُعِيَتْ',
        '2d': 'دُعِيتُمَا',
        '3md': 'دُعِيَا',
        '3fd': 'دُعِيَتَا',
        '1p': 'دُعِينَا',
        '2mp': 'دُعِيتُمْ',
        '2fp': 'دُعِيتُنَّ',
        '3mp': 'دُعُوا',
        '3fp': 'دُعِينَ',
      })
    })
  })

  describe('doubly weak roots', () => {
    test('رَوِيَ (Form I)', () => {
      expect(conjugatePassivePast(getVerb('روي', 1))).toEqual({
        '1s': 'رُوِيتُ',
        '2ms': 'رُوِيتَ',
        '2fs': 'رُوِيتِ',
        '3ms': 'رُوِيَ',
        '3fs': 'رُوِيَتْ',
        '2d': 'رُوِيتُمَا',
        '3md': 'رُوِيَا',
        '3fd': 'رُوِيَتَا',
        '1p': 'رُوِينَا',
        '2mp': 'رُوِيتُمْ',
        '2fp': 'رُوِيتُنَّ',
        '3mp': 'رُوُوا',
        '3fp': 'رُوِينَ',
      })
    })
  })

  describe('hamzated final-weak roots', () => {
    test('أَتَى (Form I)', () => {
      expect(conjugatePassivePast(getVerb('أتي', 1))).toEqual({
        '1s': 'أُتِيتُ',
        '2ms': 'أُتِيتَ',
        '2fs': 'أُتِيتِ',
        '3ms': 'أُتِيَ',
        '3fs': 'أُتِيَتْ',
        '2d': 'أُتِيتُمَا',
        '3md': 'أُتِيَا',
        '3fd': 'أُتِيَتَا',
        '1p': 'أُتِينَا',
        '2mp': 'أُتِيتُمْ',
        '2fp': 'أُتِيتُنَّ',
        '3mp': 'أُتُوا',
        '3fp': 'أُتِينَ',
      })
    })
  })
})
